# Ejercicios Datos

In [7]:
import numpy as np
import pandas as pd

---

## Parte I

### Adquisición y guardado de datos.

- Lee los datos del fichero train.txt.

In [16]:
df = pd.read_csv('data/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- Cambia algunos de los datos y escribe el fichero train_mod.csv.

In [33]:
df.iloc[2:20, 5:10] = 0

In [34]:
df.to_csv('tmp/train_mod.csv')

### Limpieza y preparación de datos.

- Carga el fichero  train.csv.

In [35]:
df = pd.read_csv('data/train.csv')
print(df.shape)
df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- Elimina todas las filas con NaN.

In [36]:
df2 = df.dropna()
df2.shape

(183, 12)

- Elimina todos los registros donde la edad sea superior al tercer cuartil de esta.

In [41]:
df[df['Age'] < df.Age.quantile(0.75)]
df.shape

(891, 12)

In [40]:
df[df.Age < df.Age.quantile(q=0.75)]
df.shape

(891, 12)

In [27]:
df.Age.quantile(0.75)

38.0

---

## Parte II

### Operaciones de combinar, juntar y agrupar.

- Calula el número de pasajeros por clase.

- Calula la edad media de los supervivientes y los no supervivientes.

- Calula el porcentage de supervientes por edad.

- Crea un gráfico de barras de los datos anteriores.

- Crea una tabla pivote con supervivientes como índice, la clase como columnas y la media de edad.